{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "xW6JFfar-sfq"
   },
   "source": [
    "### Generate knowledge graph and support queries using Neo4j\n",
    "#### Menu driven query interface present in this notebook\n",
    "Dependency - install py2neo; \n",
    "Prerequisite - Install and have a graph instance running in Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "RvWG9Vwo-sfu"
   },
   "source": [
    "#### Install Py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 0,
   "metadata": {
    "colab": {},
    "colab_type": "code",
    "collapsed": true,
    "id": "hilbEVVU-sfw",
    "outputId": "efd17804-15e7-4030-b8a8-e88af3a3754a"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: py2neo in /Users/priyankha/anaconda3/lib/python3.7/site-packages (4.2.0)\n",
      "Requirement already satisfied: click>=7.0 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (7.0)\n",
      "Requirement already satisfied: pytz in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (2018.5)\n",
      "Requirement already satisfied: colorama in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (0.3.9)\n",
      "Requirement already satisfied: urllib3[secure]<1.25,>=1.23 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (1.23)\n",
      "Requirement already satisfied: neobolt<1.8,>=1.7.3 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (1.7.9)\n",
      "Requirement already satisfied: neotime<1.8,>=1.7.4 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (1.7.4)\n",
      "Requirement already satisfied: pygments<2.4,>=2.3.0 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (2.3.1)\n",
      "Requirement already satisfied: prompt-toolkit<2.1,>=2.0.7 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (2.0.9)\n",
      "Requirement already satisfied: pyOpenSSL>=0.14 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (18.0.0)\n",
      "Requirement already satisfied: cryptography>=1.3.4 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2.3.1)\n",
      "Requirement already satisfied: idna>=2.0.0 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2.7)\n",
      "Requirement already satisfied: certifi in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2018.8.24)\n",
      "Requirement already satisfied: ipaddress in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (1.0.22)\n",
      "Requirement already satisfied: six in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from neotime<1.8,>=1.7.4->py2neo) (1.11.0)\n",
      "Requirement already satisfied: wcwidth in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from prompt-toolkit<2.1,>=2.0.7->py2neo) (0.1.7)\n",
      "Requirement already satisfied: asn1crypto>=0.21.0 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (0.24.0)\n",
      "Requirement already satisfied: cffi!=1.11.3,>=1.7 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (1.11.5)\n",
      "Requirement already satisfied: pycparser in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from cffi!=1.11.3,>=1.7->cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (2.18)\n",
      "\u001b[33mYou are using pip version 18.1, however version 19.1 is available.\n",
      "You should consider upgrading via the 'pip install --upgrade pip' command.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "! pip install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "colab": {},
    "colab_type": "code",
    "id": "E8Py6Hi2-sgH"
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from py2neo import Node, Relationship\n",
    "import pickle\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "3QeOIUzT-sgQ"
   },
   "source": [
    "### Load Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "colab": {},
    "colab_type": "code",
    "id": "zhqFl-c7-sgS"
   },
   "outputs": [],
   "source": [
    "svos = pd.read_csv(\"svos.csv\", names = ['sub', 'rel', 'obj'])\n",
    "pickle_in = open(\"entity_dict.pickle\",\"rb\")\n",
    "entities = pickle.load(pickle_in)\n",
    "pickle_in.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "W1x26Yuy-sgb"
   },
   "source": [
    "### Graph construction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connect to Neo4j using corresponding <port:7687> and <password>\n",
    "graph = Graph(\"bolt://localhost:7687\",password=\"graph\")\n",
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "colab": {},
    "colab_type": "code",
    "id": "adScMnkb-sgc"
   },
   "outputs": [],
   "source": [
    "# Parse the entities and build the knowledge graph in Neo4j Database\n",
    "for index, row in svos.iterrows():\n",
    "    sub, rel, obj = row\n",
    "    \n",
    "    sub_node = graph.nodes.match(entities.get(sub, \"Object\"), name=sub).first()\n",
    "    obj_node = graph.nodes.match(\"Object\", name=obj).first()\n",
    "    if not sub_node:\n",
    "        sub_node = Node(entities.get(sub, \"Object\"),name = sub)\n",
    "    if not obj_node:\n",
    "        obj_node = Node(entities.get(obj, \"Object\"),name = obj)\n",
    "    relation = Relationship.type(rel)    \n",
    "    graph.merge(relation(sub_node, obj_node), entities.get(sub, \"Object\"), \"name\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "lSCRo6QN-sgj"
   },
   "source": [
    "## Query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "colab": {},
    "colab_type": "code",
    "id": "OJ7dfsPI-sgl",
    "outputId": "eefc92bc-c955-4768-86dc-809a04031138"
   },
   "outputs": [],
   "source": [
    "# Cypher queries\n",
    "# Query to display names of all actors present in the knowledge graph\n",
    "def query_actors_names(graph):\n",
    "    nodes = graph.run(\"MATCH (:Object {name: 'actor'})-[r]-(m)RETURN r, m\")\n",
    "    names = [ node['m']['name'] for node in nodes]\n",
    "    print(\"Query result for 'names of all actors': \")\n",
    "    print(names)\n",
    "\n",
    "# Query to display names of all producers present in the knowledge graph\n",
    "def query_producers_names(graph):\n",
    "    nodes = graph.run(\"MATCH (:Object {name: 'producer'})-[r]-(m)RETURN r, m\")\n",
    "    names = [ node['m']['name'] for node in nodes]\n",
    "    print(\"Query result for 'names of all producers': \")\n",
    "    print(names)\n",
    "\n",
    "# Query to display all node relations\n",
    "def query_all_node_relations(graph):\n",
    "    nodes = graph.run(\"MATCH (n)-[r]->(m) RETURN r\")\n",
    "    print(\"Query result for 'all relations': \")\n",
    "    print(nodes.to_table())\n",
    "\n",
    "# Query to display people with multiple talents/roles such acting, singing\n",
    "def multi_talented(graph):\n",
    "    nodes = graph.run(\"MATCH (:Object {name: 'actor'})-[r]-(m)RETURN r, m\")\n",
    "    print(\"Query result for 'all multi-talented people': \")\n",
    "    for node in nodes:\n",
    "        rels = graph.run(\"MATCH (:PERSON {name: '%s'})-[r]-(obj)RETURN count(r) as num_rels\" % node['m']['name'])\n",
    "        for rec in rels:\n",
    "            if rels[\"num_rels\"]>1:\n",
    "                print(node['m']['name'])\n",
    "\n",
    "# Query about the description of a given actor                \n",
    "def describe(graph, actor):\n",
    "    nodes = graph.run(\"MATCH (:PERSON {name: '%s'})-[r]->(m)RETURN r,m\" % actor)\n",
    "    flag=True\n",
    "    print(\"Query result for description of\", actor)\n",
    "    for node in nodes:\n",
    "        print(node['r'])\n",
    "        flag = False\n",
    "    if flag:\n",
    "        print(\"Not found\")\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "colab": {},
    "colab_type": "code",
    "id": "_rJJqiFk-sg1",
    "outputId": "f98b11f7-2956-4e6a-fb57-d69ee7c8a96c"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Query result for 'names of all actors': \n",
      "['Jon Avery Abrahams', 'Zachary Burr Abel', 'Victor Aaron Ramirez', 'Quinton Aaron', 'Kirk M. Acevedo', 'Murray Abraham October', 'Alexander Bud Abbott', 'Christopher Jacob Abbott', 'Adam Keefe Horovitz', 'Jensen Ross Ackles', 'Yousef AbuTaleb', 'Jay Acovone', 'Walter Abel', 'Jacob Allen Abel', 'Bruce Paul Abbott']\n",
      "\n",
      "Query result for 'names of all producers': \n",
      "['Yousef AbuTaleb']\n",
      "\n",
      "Query result for 'all multi-talented people': \n",
      "Jon Avery Abrahams\n",
      "Victor Aaron Ramirez\n",
      "Adam Keefe Horovitz\n",
      "Jensen Ross Ackles\n",
      "Yousef AbuTaleb\n",
      "Jacob Allen Abel\n",
      "\n",
      "Query result for description of Jacob Allen Abel\n",
      "(Jacob Allen Abel)-[:is {}]->(singer)\n",
      "(Jacob Allen Abel)-[:is {}]->(actor)\n"
     ]
    }
   ],
   "source": [
    "query_actors_names(graph)\n",
    "print()\n",
    "query_producers_names(graph)\n",
    "print()\n",
    "# query_all_node_relations(graph)\n",
    "multi_talented(graph)\n",
    "print()\n",
    "describe(graph, 'Jacob Allen Abel')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Menu driven Query interface"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Menu options\n",
    "def option_5(graph):\n",
    "    person = input(\"Enter Person name:\")\n",
    "    describe(graph, person)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Menu \n",
      " --------\n",
      "\n",
      "1. Get names of all actors\n",
      "2. Get names of all producers\n",
      "3. Get names of all multi-talented people\n",
      "4. Get description of a specific person\n",
      "5. Get all node relations present in KG\n",
      "0. Exit\n",
      "Enter choice (0 to 5): 1\n",
      "Query result for 'names of all actors': \n",
      "['Jon Avery Abrahams', 'Zachary Burr Abel', 'Victor Aaron Ramirez', 'Quinton Aaron', 'Kirk M. Acevedo', 'Murray Abraham October', 'Alexander Bud Abbott', 'Christopher Jacob Abbott', 'Adam Keefe Horovitz', 'Jensen Ross Ackles', 'Yousef AbuTaleb', 'Jay Acovone', 'Walter Abel', 'Jacob Allen Abel', 'Bruce Paul Abbott']\n",
      "\n",
      "Menu \n",
      " --------\n",
      "\n",
      "1. Get names of all actors\n",
      "2. Get names of all producers\n",
      "3. Get names of all multi-talented people\n",
      "4. Get description of a specific person\n",
      "5. Get all node relations present in KG\n",
      "0. Exit\n",
      "Enter choice (0 to 5): 2\n",
      "Query result for 'names of all producers': \n",
      "['Yousef AbuTaleb']\n",
      "\n",
      "Menu \n",
      " --------\n",
      "\n",
      "1. Get names of all actors\n",
      "2. Get names of all producers\n",
      "3. Get names of all multi-talented people\n",
      "4. Get description of a specific person\n",
      "5. Get all node relations present in KG\n",
      "0. Exit\n",
      "Enter choice (0 to 5): 3\n",
      "Query result for 'all multi-talented people': \n",
      "Jon Avery Abrahams\n",
      "Victor Aaron Ramirez\n",
      "Adam Keefe Horovitz\n",
      "Jensen Ross Ackles\n",
      "Yousef AbuTaleb\n",
      "Jacob Allen Abel\n",
      "\n",
      "Menu \n",
      " --------\n",
      "\n",
      "1. Get names of all actors\n",
      "2. Get names of all producers\n",
      "3. Get names of all multi-talented people\n",
      "4. Get description of a specific person\n",
      "5. Get all node relations present in KG\n",
      "0. Exit\n",
      "Enter choice (0 to 5): 4\n",
      "Enter Person name:Jacob Allen Abel\n",
      "Query result for description of Jacob Allen Abel\n",
      "(Jacob Allen Abel)-[:is {}]->(singer)\n",
      "(Jacob Allen Abel)-[:is {}]->(actor)\n",
      "\n",
      "Menu \n",
      " --------\n",
      "\n",
      "1. Get names of all actors\n",
      "2. Get names of all producers\n",
      "3. Get names of all multi-talented people\n",
      "4. Get description of a specific person\n",
      "5. Get all node relations present in KG\n",
      "0. Exit\n",
      "Enter choice (0 to 5): 5\n",
      "Query result for 'all relations': \n",
      " r                                                                   \n",
      "---------------------------------------------------------------------\n",
      " (Rodolfo Perez Acosta)-[:was {}]->(MexicanAmerican character actor) \n",
      " (Jacob Allen Abel)-[:is {}]->(singer)                               \n",
      " (Yousef AbuTaleb)-[:is {}]->(producer)                              \n",
      " (Lee William Aaker)-[:is {}]->(child actor)                         \n",
      " (Willie Aames)-[:is {}]->(director television producer)             \n",
      " (Willie Aames)-[:is {}]->(screenwriter)                             \n",
      " (Wee Man)-[:is {}]->(performer)                                     \n",
      " (Jason Shannon Acuna)-[:is {}]->(performer)                         \n",
      " (Wee Man)-[:is {}]->(one)                                           \n",
      " (Jason Shannon Acuna)-[:is {}]->(one)                               \n",
      " (Philip Abbott)-[:was {}]->(character actor)                        \n",
      " (Jon Avery Abrahams)-[:is {}]->(actor)                              \n",
      " (Zachary Burr Abel)-[:is {}]->(actor)                               \n",
      " (Victor Aaron Ramirez)-[:was {}]->(actor)                           \n",
      " (Quinton Aaron)-[:is {}]->(actor)                                   \n",
      " (Kirk M. Acevedo)-[:is {}]->(actor)                                 \n",
      " (Murray Abraham October)-[:is {}]->(actor)                          \n",
      " (Alexander Bud Abbott)-[:was {}]->(actor)                           \n",
      " (Christopher Jacob Abbott)-[:is {}]->(actor)                        \n",
      " (Adam Keefe Horovitz)-[:is {}]->(actor)                             \n",
      " (Jensen Ross Ackles)-[:is {}]->(actor)                              \n",
      " (Yousef AbuTaleb)-[:is {}]->(actor)                                 \n",
      " (Jay Acovone)-[:is {}]->(actor)                                     \n",
      " (Walter Abel)-[:was {}]->(actor)                                    \n",
      " (Jacob Allen Abel)-[:is {}]->(actor)                                \n",
      " (Bruce Paul Abbott)-[:is {}]->(actor)                               \n",
      " (Abbott)-[:gained {}]->(notoriety)                                  \n",
      " (Jensen Ross Ackles)-[:is {}]->(director)                           \n",
      " (which)-[:earned {}]->(Ackles)                                      \n",
      " (which)-[:earned {}]->(Award nominations)                           \n",
      " (Adam Keefe Horovitz)-[:is {}]->(rapper guitarist)                  \n",
      " (Cent)-[:is {}]->(television producer entrepreneur)                 \n",
      " (Cent)-[:is {}]->(investor)                                         \n",
      " (Born)-[:began {}]->(selling)                                       \n",
      " (Victor Aaron Ramirez)-[:was {}]->(voice)                           \n",
      " (Jon Avery Abrahams)-[:are {}]->(Bobby)                             \n",
      " (Costello)-[:were {}]->(comedy duo)                                 \n",
      " (Abbott)-[:were {}]->(comedy duo)                                   \n",
      "\n",
      "\n",
      "Menu \n",
      " --------\n",
      "\n",
      "1. Get names of all actors\n",
      "2. Get names of all producers\n",
      "3. Get names of all multi-talented people\n",
      "4. Get description of a specific person\n",
      "5. Get all node relations present in KG\n",
      "0. Exit\n",
      "Enter choice (0 to 5): 0\n",
      "Exiting....\n"
     ]
    }
   ],
   "source": [
    "while True:\n",
    "    print()\n",
    "    print(\"Menu \\n --------\\n\")\n",
    "    print(\"1. Get names of all actors\")\n",
    "    print(\"2. Get names of all producers\")\n",
    "    print(\"3. Get names of all multi-talented people\")\n",
    "    print(\"4. Get description of a specific person\")\n",
    "    print(\"5. Get all node relations present in KG\")\n",
    "    print(\"0. Exit\")\n",
    "    choice = input(\"Enter choice (0 to 5): \")\n",
    "    switch = {\n",
    "        '1' : 'query_actors_names(graph)',\n",
    "        '2' : 'query_producers_names(graph)',\n",
    "        '3' : 'multi_talented(graph)',\n",
    "        '4' : 'option_5(graph)',\n",
    "        '5' : 'query_all_node_relations(graph)',\n",
    "    }\n",
    "    if choice == '0':\n",
    "        print(\"Exiting....\")\n",
    "        break\n",
    "    method_to_call = switch.get(choice, None)\n",
    "    if method_to_call:\n",
    "        exec(method_to_call)\n",
    "    else:\n",
    "        print(\"Invalid choice\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Comparison with Google knowledge graph API response\n",
    "##### Comparing response for Person description"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Note: The API KEY needs to be updated with an activate one"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "import urllib\n",
    "\n",
    "API_KEY = 'AIzaSyAL-FWUBnWCfUpXs1woYNzX3cpBBHI-Qe4'\n",
    "SERVICE_URL = 'https://kgsearch.googleapis.com/v1/entities:search'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query Google Knowledge graph API \n",
    "def query_google_api(query):\n",
    "    params = {\n",
    "        'query': query,\n",
    "        'limit': 10,\n",
    "        'indent': True,\n",
    "        'key': API_KEY,\n",
    "    }\n",
    "    url = SERVICE_URL + '?' + urllib.parse.urlencode(params)\n",
    "    response = json.loads(urllib.request.urlopen(url).read())\n",
    "    return response\n",
    "\n",
    "# Display formatted response \n",
    "def display_formatted_response(response):\n",
    "    result = response['itemListElement'][0]['result']\n",
    "    print(\"Name:\" + result['name'])\n",
    "    print(\"Description: \"+ result['description'])\n",
    "    print(\"Detailed Description: \" + result['detailedDescription']['articleBody'].split(';')[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name:Jake Abel\n",
      "Description: American actor\n",
      "Detailed Description: Jacob Allen Abel is an American actor and singer who is known for playing Adam Milligan in the CW series Supernatural, Luke Castellan in the film adaptation of Percy Jackson &amp\n"
     ]
    }
   ],
   "source": [
    "# Response for Actor Jake Abel \n",
    "response =  query_google_api('Jake Abel')\n",
    "display_formatted_response(response)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Comparison of response for description of \"Adam Keefe Horovitz\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Google KG response: \n",
      "Name:Ad-Rock\n",
      "Description: American rapper\n",
      "Detailed Description: Adam Keefe Horovitz, better known as Ad-Rock or King Ad-Rock, is an American rapper, guitarist and actor. He is best known as a member of the hip hop group the Beastie Boys. He is married to musician and feminist activist Kathleen Hanna.\n",
      "\n",
      "Our algorithm's KG response:\n",
      "Query result for description of Adam Keefe Horovitz\n",
      "(Adam Keefe Horovitz)-[:is {}]->(actor)\n",
      "(Adam Keefe Horovitz)-[:is {}]->(rapper guitarist)\n"
     ]
    }
   ],
   "source": [
    "person_name = 'Adam Keefe Horovitz'\n",
    "response =  query_google_api(person_name)\n",
    "print(\"Google KG response: \")\n",
    "display_formatted_response(response)\n",
    "\n",
    "print()\n",
    "print(\"Our algorithm's KG response:\")\n",
    "describe(graph, person_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "colab": {
   "name": "Neo4jGraph.ipynb",
   "provenance": [],
   "version": "0.3.2"
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
